{"items":[{"username":"dave1010uk","comment":"John Resig's blog posts never fail to impress.__BR__The bit comparing Asm.js to Google's Native Client is interesting.","id":"5486669","grayedOutPercent":0,"reply_id":"5486669&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"44 minutes ago","children":[]},{"username":"jcampbell1","comment":"Does anyone know how hard it would be to port an h264 decoder to asm.js?  If it worked, it could be used to shim h264 support into Firefox.","id":"5486878","grayedOutPercent":0,"reply_id":"5486878&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"13 minutes ago","children":[{"username":"jeresig","comment":"I believe one has already been ported using Emscripten - but this was a while ago, I'd be curious to see how fast it runs now with Asm.js: https://github.com/mbebenita/Broadway ","id":"5486886","grayedOutPercent":0,"reply_id":"5486886&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"12 minutes ago","children":[]},{"username":"dave1010uk","comment":"The reverse has been done: WebM has been ported to JavaScript with Emscripten, which means all browsers (IE9+) can play WebM to some degree.__BR__http://badassjs.com/post/17218459521/webm-and-webp-hand-ported-to-javascript-for-all ","id":"5486905","grayedOutPercent":0,"reply_id":"5486905&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"9 minutes ago","children":[]},{"username":"robin_reala","comment":"Fairly easily if you start with Broadway: it&amp;euro;&amp;trade;s an Emscripten port of Android&amp;euro;&amp;trade;s H264 software decoder that writes to a WebGL canvas.__BR__https://github.com/mbebenita/Broadway ","id":"5486902","grayedOutPercent":0,"reply_id":"5486902&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"9 minutes ago","children":[]}]},{"username":"theycallmemorty","comment":"In theory, would it be possible to take an ActiveX or NPAPI plugin and compile it down to asm.js-compatible javascript?","id":"5486901","grayedOutPercent":0,"reply_id":"5486901&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"10 minutes ago","children":[]},{"username":"niggler","comment":"Wow, Mozilla is making a really big marketing push for asm.js.","id":"5486734","grayedOutPercent":77,"reply_id":"5486734&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"35 minutes ago","children":[{"username":"k3n","comment":"You know Resig isn't employed by Mozilla anymore, right?__BR__This is just a JS enthusiast (understatement of the year, perhaps) discussing a JS topic.","id":"5486869","grayedOutPercent":0,"reply_id":"5486869&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"14 minutes ago","children":[{"username":"niggler","comment":"Maybe I'm a bit old-fashioned here, but I'd expect a discussion of JS performance to be coupled with a performance test conducted by the author.  Is that too much to ask?","id":"5486893","grayedOutPercent":0,"reply_id":"5486893&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"11 minutes ago","children":[]}]},{"username":"robin_reala","comment":"What makes you think this is a marketing piece instead of a normal blog post by John?","id":"5486784","grayedOutPercent":0,"reply_id":"5486784&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"28 minutes ago","children":[{"username":"niggler","comment":"Other than rehashing the exact arguments and diagrams presented in the mozilla marketing material and including an extensive \\\"interview\\\" with a mozilla engineer:__BR__- I would have expected him to have tried it.  There's no evidence in the post that he even fired up firefox nightly and ran even a simple test.  The performance graph is straight out of asm.js marketing material__BR__- In discussing chrome's performance, he just writes \\\"A 4-10x performance difference is substantial\\\" without explaining why chrome's performance suffers so much relative to firefox without asm.js (take the skinning demo.  Why is chrome significantly worse than firefox?)  This is a point that many have discussed, including some here in various posts about asm.js__BR__- Certain sentences seem artificial.  If you've read other posts by him, does \\\"It is interesting to see such a large performance chasm appearing between Asm.js and the current engines in Firefox and Chrome. A 4-10x performance difference is substantial (this is in the realm of comparing these browsers to the performance of IE 6). Interestingly even with this performance difference many of these Asm.js demos are still usable on Chrome and Firefox, which is a good indicator for the current state of JavaScript engines. That being said their performance is simply not as good as the performance offered by a browser that is capable of optimizing Asm.js code.\\\" sound like something he would write?  At all?","id":"5486854","grayedOutPercent":0,"reply_id":"5486854&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"17 minutes ago","children":[{"username":"jeresig","comment":"Ok, I'll bite.__BR__- I did not run performance benchmarks on my system because Asm.js does not yet support OS X (which is my primary OS). I fully intend to run some tests, and hopefully make some of my own, when that time comes. In the meantime it's not really beneficial for me to just re-run the same benchmarks that others have run on those platforms.__BR__- I thought this was obvious: Chrome and normal Firefox are so much slower because they do not explicitly optimize the Asm.js code path.__BR__- That's complete nonsense. I can't believe I have to say this but yes, I wrote those sentences.","id":"5486945","grayedOutPercent":0,"reply_id":"5486945&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"3 minutes ago","children":[]},{"username":"jlongster","comment":"It sounds more like you're looking at all of this through a strong negative filter.","id":"5486932","grayedOutPercent":0,"reply_id":"5486932&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"6 minutes ago","children":[]}]}]},{"username":"dave1010uk","comment":"Whether this the aim of this post was marketing or not (as I believe), it's a really in depth and interesting read if you're a programmer. Even more so if you use JavaScript. It would be great if all corporate marketing was like this!","id":"5486892","grayedOutPercent":0,"reply_id":"5486892&amp;whence=%69%74%65%6d%3f%69%64%3d%35%34%38%36%36%30%35","time":"11 minutes ago","children":[]}]}]} 
